# Strings to bot answers:


# extra/help
command_incorrect = "Неверная команда.\nНажмите на одну из кнопок ниже:"
easter = "Мем смешной, ситуация страшная\nhttps://www.youtube.com/watch?v=yN2RFr9RQVM"
regions_message = "*Список регионов России* 🇷🇺\n\n`01` - Республика Адыгея\n`02` - Республика Башкортостан\n`03` - Республика Бурятия\n`04` - Республика Алтай\n`05` - Республика Дагестан\n`06` - Республика Ингушетия\n`07` - Кабардино-Балкарская Республика\n`08` - Республика Калмыкия\n`09` - Республика Карачаево-Черкесия\n`10` - Республика Карелия\n`11` - Республика Коми\n`12` - Республика Марий Эл\n`13` - Республика Мордовия\n`14` - Республика Саха (Якутия)\n`15` - Республика Северная Осетия — Алания\n`16` - Республика Татарстан\n`17` - Республика Тыва\n`18` - Удмуртская Республика\n`19` - Республика Хакасия\n`20` - Чеченская Республика\n`21` - Чувашская Республика\n`22` - Алтайский край\n`23` - Краснодарский край\n`24` - Красноярский край\n`25` - Приморский край\n`26` - Ставропольский край\n`27` - Хабаровский край\n`28` - Амурская область\n`29` - Архангельская область\n`30` - Астраханская область\n`31` - Белгородская область\n`32` - Брянская область\n`33` - Владимирская область\n`34` - Волгоградская область\n`35` - Вологодская область\n`36` - Воронежская область\n`37` - Ивановская область\n`38` - Иркутская область\n`39` - Калининградская область\n`40` - Калужская область\n`41` - Камчатский край\n`42` - Кемеровская область\n`43` - Кировская область\n`44` - Костромская область\n`45` - Курганская область\n`46` - Курская область\n`47` - Ленинградская область\n`48` - Липецкая область\n`49` - Магаданская область\n`50` - Московская область\n`51` - Мурманская область\n`52` - Нижегородская область\n`53` - Новгородская область\n`54` - Новосибирская область\n`55` - Омская область\n`56` - Оренбургская область\n`57` - Орловская область\n`58` - Пензенская область\n`59` - Пермский край\n`60` - Псковская область\n`61` - Ростовская область\n`62` - Рязанская область\n`63` - Самарская область\n`64` - Саратовская область\n`65` - Сахалинская область\n`66` - Свердловская область\n`67` - Смоленская область\n`68` - Тамбовская область\n`69` - Тверская область\n`70` - Томская область\n`71` - Тульская область\n`72` - Тюменская область\n`73` - Ульяновская область\n`74` - Челябинская область\n`75` - Забайкальский край\n`76` - Ярославская область\n`77` - Москва\n`78` - Санкт-Петербург\n`79` - Еврейская автономная область\n`82` - Республика Крым\n`83` - Ненецкий автономный округ\n`86` - Ханты-Мансийский автономный округ Югра\n`87` - Чукотский автономный округ\n`89` - Ямало-Ненецкий автономный округ\n`92` - Севастополь\n`90` - ОУ, находящиеся за границей\n\nВведите две цифры региона:"
timetable_message = "*Официальный график публикации результатов ЕГЭ-2021 🗓*\nЭти даты являются лишь \"дедлайном\" для ГЭК — как правило, результаты появляются за день до указанных дат\n\n`17 июня (чт)` — География, Литература, Химия (31.05)\n`22 июня (вт)` — Русский язык (03.06)\n`23 июня (ср)` — Русский язык (04.06)\n`23 июня (ср)` — Математика (профильный уровень, 07.06)\n`28 июня (пн)` — История, Физика (11.06)\n`30 июня (ср)` — Обществознание (15.06)\n`05 июля (пн)` — Биология (18.06)\n`07 июля (ср)` — Иностранные языки\n`08 июля (чт)` — Информатика (24.06, 25.06)"
donate_message = "Спасибо, что выбрали моего бота!\nБот может сказать спасибо и тебе, если ты оформишь донейт ☺️\n\n" \
                 "Для работы сервиса требуется оплачивать выделенный облачный сервер и регулярно проверять состояние " \
                 "платформы. Поэтому если ты хочешь помочь работе бота (или если тебе просто очень понравился этот " \
                 "сервис!), отправь пожертвование на его поддержку.\n\n*Ссылка обновлена!*\nhttps://www.tinkoff.ru/rm/manokhin.anton1/SgJ2K21778 "
help_message = "*Почему не удаётся получить результаты?*\nПроверять результаты можно максимум раз в 30 секунд — чтобы не " \
               "нагружать сервера Telegram и ЕГЭ. Если хочешь узнать результаты первым, включи уведомления!\n" \
               "\n*Сервер не отвечает на запрос, что делать?*\nНабраться терпения:) Скорость ответа бота зависит от " \
               "скорости ответа сайта check.ege.edu.ru.\n\n*Не могу авторизоваться/бот не отвечает на команды*\n" \
               "Попробуйте нажать на кнопку \"Удалить данные\" или отправить /logout, а затем авторизуйтесь снова.\n\n" \
               "*Какие данные обо мне хранит бот?*\nВаше имя и номер документа хранятся в зашифрованном виде и " \
               "требуются только для прохождения авторизации, после которой они будут сразу же " \
               "удалены с сервера. После авторизации бот будет " \
               "хранить в обезличенном виде *только*: номер региона, токен для получения данных об экзаменах и их " \
               "результаты. \n\n*Где ознакомиться с полной политикой в отношении обработки персональных данных?*\n" \
               "Хоть мы и не храним чувствительные персональные данные после авторизации, но закон требует от " \
               "нас вашего согласия на их обработку, реализуемого с помощью " \
               "установленной Политики в отношении обработки персональных данных. С актуальной версией соглашения " \
               "можно ознакомиться " \
               "по адресу https://manokh.com/egecheckbot/privacy. \n\n*Как полностью удалить информацию о себе из " \
               "бота?*\nНажмите на кнопку \"Выйти из " \
               "профиля\" или отправьте /logout. Данные удалятся автоматически.\n\n*Откуда берётся информация об " \
               "экзаменах?*\nВся информация об экзаменах берётся через API сайта check.ege.edu.ru.\n\n*Что означает " \
               "«результат скрыт»?*\nЗначит, ваш результат уже есть в базах ЕГЭ, но пока не показывается на " \
               "сайте, так как ваш регион ещё загружает сканы работ.\n\n*Результаты " \
               "достоверны?*\nИнформация об экзаменах и их результатах отправляется ровно в том виде, как они " \
               "будут выглядеть на check.ege.edu.ru."
help_message2 = "\n\n*Как запросить " \
                "сканы работ/разбалловку по заданиям?*\nЭти функции будут реализованы немного позднее.\n\n*Возникла " \
                "другая ошибка/нашли баг*\nПиши разработчику @amanokh!\n\n*Есть ли пасхалки?*\nДа, есть:)\n\n"
notify_notify = "*Мне очень нужна твоя поддержка! 👨‍💻 ❤️*\nЕсли тебе понравился мой бот и ты хочешь помочь работе " \
                "над ним, ты можешь отправить пожертвование, нажав на эту кнопку:"
regions = {
    1: "Республика Адыгея",
    2: "Республика Башкортостан",
    3: "Республика Бурятия",
    4: "Республика Алтай",
    5: "Республика Дагестан",
    6: "Республика Ингушетия",
    7: "Кабардино-Балкарская Республика",
    8: "Республика Калмыкия",
    9: "Республика Карачаево-Черкесия",
    10: "Республика Карелия",
    11: "Республика Коми",
    12: "Республика Марий Эл",
    13: "Республика Мордовия",
    14: "Республика Саха (Якутия)",
    15: "Республика Северная Осетия — Алания",
    16: "Республика Татарстан",
    17: "Республика Тыва",
    18: "Удмуртская Республика",
    19: "Республика Хакасия",
    20: "Чеченская Республика",
    21: "Чувашская Республика",
    22: "Алтайский край",
    23: "Краснодарский край",
    24: "Красноярский край",
    25: "Приморский край",
    26: "Ставропольский край",
    27: "Хабаровский край",
    28: "Амурская область",
    29: "Архангельская область",
    30: "Астраханская область",
    31: "Белгородская область",
    32: "Брянская область",
    33: "Владимирская область",
    34: "Волгоградская область",
    35: "Вологодская область",
    36: "Воронежская область",
    37: "Ивановская область",
    38: "Иркутская область",
    39: "Калининградская область",
    40: "Калужская область",
    41: "Камчатский край",
    42: "Кемеровская область",
    43: "Кировская область",
    44: "Костромская область",
    45: "Курганская область",
    46: "Курская область",
    47: "Ленинградская область",
    48: "Липецкая область",
    49: "Магаданская область",
    50: "Московская область",
    51: "Мурманская область",
    52: "Нижегородская область",
    53: "Новгородская область",
    54: "Новосибирская область",
    55: "Омская область",
    56: "Оренбургская область",
    57: "Орловская область",
    58: "Пензенская область",
    59: "Пермский край",
    60: "Псковская область",
    61: "Ростовская область",
    62: "Рязанская область",
    63: "Самарская область",
    64: "Саратовская область",
    65: "Сахалинская область",
    66: "Свердловская область",
    67: "Смоленская область",
    68: "Тамбовская область",
    69: "Тверская область",
    70: "Томская область",
    71: "Тульская область",
    72: "Тюменская область",
    73: "Ульяновская область",
    74: "Челябинская область",
    75: "Забайкальский край",
    76: "Ярославская область",
    77: "Москва",
    78: "Санкт-Петербург",
    79: "Еврейская автономная область",
    82: "Республика Крым",
    83: "Ненецкий автономный округ",
    86: "Ханты-Мансийский автономный округ Югра",
    87: "Чукотский автономный округ",
    89: "Ямало-Ненецкий автономный округ",
    92: "Севастополь",
    90: "ОУ, находящиеся за границей",
}


def list_regions():
    message = "*Список регионов России* 🇷🇺\n\n"
    for code in regions:
        message += "`%s` – %s\n" % (str(code).rjust(2, '0'), regions[code])
    return message


def confirm_region(code):
    try:
        return "Выбранный регион: *%s*" % regions[code]
    except KeyError:
        return "Неверный формат региона."


# /start
start_beta = "*Из-за большой нагрузки на сервера Telegram бот может отвечать дольше. Пожалуйста, будьте терпеливы!❤️*"
start_agree = "Привет! 👋🏻\nПродолжая работу c этим сервисом, вы соглашаетесь с [Политикой обработки персональных " \
              "данных](https://manokh.com/egecheckbot/privacy).\n\n🤫 Все данные о себе из бота в " \
              "любой момент можно удалить командой /logout. \nПодробнее — в разделе «Помощь»."
start_name = "Введите ФИО (отчество при наличии):"
start_authed = "Похоже, что вы уже авторизованы.\nПолучить результаты можно командой /check, а выйти из профиля с " \
               "помощью команды /logout."

# /login
login_name_incorrect = "Некорректный формат. Пожалуйста, введите ФИО одним сообщением из трёх слов " \
                       "(двух при отсутствии отчества):"
login_region = "Введите номер региона двумя цифрами, как на автомобильных номерах:"
login_region_incorrect = "Некорректный формат или номер региона. Пожалуйста, введите номер региона двумя цифрами, как указано в списке:"
login_passport = "Введите номер паспорта (6 цифр) или код регистрации на экзамен (12 цифр), " \
                 "выданный в образовательной организации:"
login_passport_incorrect = "Некорректный формат. Пожалуйста, введите 6 цифр номера паспорта или 12 цифр " \
                           "номера регистрации на экзамен:"
login_auth_process = "Идёт авторизация..."
login_authened = "Авторизация прошла успешно!\nСейчас придут твои результаты:"
login_captcha_incorrect = "Капча введена неверно, пожалуйста, попробуйте ещё раз или запросите новую:"
login_captcha_prompt = "Пожалуйста, введите цифры с капчи:\n_(придёт в течение нескольких секунд)_:"
login_wrong_data = "Возникла ошибка. Проверьте правильность введенных данных или повторите попытку ещё раз."
login_unauthorized = "Вы не авторизованы. Начать можно командой /start."
login_notify_off = "Уведомления о новых результатах экзаменов выключены. Включить обратно всегда можно той же " \
                   "кнопкой мини-клавиатуры."
login_notify_on = "Уведомления о новых результатах экзаменов включены 👍"

# errors
err_noans_wrong_data = "Сервер не ответил на запрос. Проверьте правильность введенных данных или " \
                       "повторите попытку ещё раз."
err_results_unexpected = "Произошла ошибка %d. Пожалуйста, попробуйте авторизоваться заново командой /start или " \
                         "напишите разработчику 👉@amanokh"
err_captcha_noans = "Произошла ошибка при получении капчи от серверов ЕГЭ. Попробуйте запросить новую капчу:"

# /clear
clear_done = "Данные о вас успешно удалены из сервиса.\nВойти снова можно с помощью кнопки ниже или команды /start."
clear_not_found = "Пользователь не найден.\nВойти снова можно с помощью кнопки ниже или команды /start."

# info/warn messages
warn_region_mos = "*Внимание!* Результаты экзаменов для учеников из Москвы выкладываются на портале mos.ru.\n" \
                  "Бот берёт информацию только с ресурса check.ege.edu.ru, на котором результаты для " \
                  "Москвы могут отсутствовать долгое время. Приносим свои извинения."
warn_region_mo = "*Внимание!* Результаты экзаменов для учеников из Московской области выкладываются на сайте " \
                 "res11.rcoi.net.\nБот берёт информацию только с ресурса check.ege.edu.ru, на котором " \
                 "результаты для Московской области могут появиться гораздо позже."
warn_region_spb = "*Внимание!* Результаты экзаменов для учеников из Санкт-Петербурга выкладываются на сайте " \
                  "ege.spb.ru.\nБот берёт информацию только с ресурса check.ege.edu.ru, на котором " \
                  "результаты для Санкт-Петербурга могут появиться гораздо позже."
